[# 220531-
220531 개발일지
> ## 웹 서버란?

---

* 웹 서버는 소프트웨어가 동작하는 컴퓨터를 말한다.

* 웹 서버의 가장 중요한 기능은 클라이언트가 요청하는 html문서나 각종 리소스를 전달한다.

* 웹 브라우저가 요청하는 리소스는 컴퓨터에 저장된 정적인 데이터나 동적인 결과가 될 수 있다


<br>

> ### 정적인 데이터란

이미지, html파일, css파일 등 컴퓨터에 저장된 파일들을 의미한다.

<br>

> ## 웹 서버 소프트웨어의 종류

---

* 가장 많이 사용하는 웹 서버는 Apache, Nginx, Microsoft IIS

* Apache는 오픈소스 소프트웨어이며 거의 대부분 운영체제에서 호환된다.

* Nginx는 더 적은 자원으로 더 빠르게 데이터를 서비스하는 것이 목적이며 오픈소스 소프트웨어이다.


<br>

>## WAS (Web Application Server)

---


클라이언트/서버 구조

클라이언트는 서비스를 제공하는 서버에게 정보를 요청하여 응답받은 결과를 사용한다.



>## DBMS(Database management system)

---

다수의 사용자가 데이터베이스 내의 데이터에 접근하도록 도와주는 DM를 관리하는 system이다.


<BR>


> ## 미들웨어 (Middleware)
 
  ---


클라이언트와 DBMS사이의 미들웨어 서버에서 동작하도록 함으로써 클라이언트는 입력과 출력만 담당하도록 한다. 데이터 조작은 미들웨어가 하고 그 결과를 클라이언트에게 전송하면 클라이언트는 그 결과를 화면에 보여준다. 복잡한 로직이 사라지고 단순히 화면에 결과만 보여주기에 프로그램 로직이 변경되어도 모든 클라이언트를 다시 배포할 필요없이 미들웨어만 변경하면 된다.
 
 <br>
  

> ### 웹 어플리케이션 서버
  
  ---
  
WAS는 일종의 미들웨어로 웹 클라이언트의 요청 중 웹 어플이 동작하도록 지원하는 목적을 가진다.

웹이 점점 복잡해지게 되면서 더 복잡한 프로그래밍 기능을 요구하게 되는데 DBMS와 연관된 경우가 많으며 미들웨어가 필요해졌다.

  
  WAS의 기능
  
  * 프로그램 실행 환경, DB접속 기능 제공
  
  * 여러개의 트랜잭션 관리
  
  * 비즈니스 로직 수행
  
  <br>


  >## 웹 서버의 기능
  
  
  * WAS도 자체적인 웹 서버 기능을 내장하고 있다.
  
  * 현재는 WAS가 가지고 있는 웹 서버로 정적인 콘텐츠는 처리하는데 있어 성능상 큰 차이가 없다.
  
  * 규모가 커질수록 웹 서버와 WAS를 분리한다.
  
  * 자원 이용의 효율성 및 장애 극복, 배포 및 유지보수의 편의성을 위해 웹서버와 WAS를 분리한다.
  
  
<br>
  

> ## ★ 해결방법 및 학습소감
  
  ---
  
  금일은 웹 호스팅과 관련하여 이론 및 실습을 해보았다. 수업내용을 다시 복습하여 이해 및 숙지하고자 노력하였다.
  
